# BIOF 440 Homework: Week 2

## Instructions

This homework must be done on a Jupyter notebook, either through JupyterLab or Notebook. The submission will consist of **2 files**; both files are required for complete submission. 

1. The homework will be provided as a `ipynb` file, to be opened in JupyterLab or Jupyter Notebook. This file must be edited to include required code, run within the _biof440_ environment to produce outputs for code, and submitted.
1. The final `ipynb` file, after all your work is done, must be converted to a HTML file using `File > Export Notebook As...` in JupyterLab or `File > Download as..` in Jupyter Notebook. Check that this HTML file contains all the outputs required from the assignment. This file needs to be submitted as well.
1. Please submit both files using the naming convention `BIOF440_HW2_Lastname.ipynb` and `BIOF440_HW2_Lastname.html`, replacing "Lastname" with your last name/surname/family name.

-----

For this class, please create a folder named `BIOF440` on your computer where all the material will reside, and within that folder create a sub-folder named `data` where you will store data sets used in class. All your deliverables should be written in the `BIOF440` folder, so that your code will be consistent with mine in terms of reading data, and will make my life correcting your homework more reasonable. If I have to go through hoops to try and run your notebook to reproduce your homework, I will deduct **5 points** from the homework. To this end, **ensure that you're running the Jupyter notebook using the biof440 environment, so that we don't have issues with packages not being installed**. 

Each full question is **30 points**. You will get full credit if all the parts are done correctly. Extra credit problems will allow you to have a score of more than 100% for this homework.

## Question 1

### 1 (A)

In the following code chunk, import the packages `numpy` and `pandas` using the usual aliases `np` and `pd` respectively.

In [1]:
import numpy as np
import pandas as pd

### 1 (B)

We spoke of the example data sets denoted table1, table2, table3, table4a, table4b and table5 (p. 63 of the pandas slides). All the files are available on Canvas and should be downloaded to the `data` folder described above. Read these 6 files into a dictionary (`dict`) object named `tbl_data`, with keys being the names listed earlier here, and the values being the actual data, using a `for-loop` and `pandas` functions. Show your code below.

In [2]:
tbl_data = {}
fnames = ['table1','table2','table3','table4a','table4b','table5']
for f in fnames:
    tbl_data[f] = pd.read_csv('data/'+f+'.csv')
tbl_data

{'table1':        country  year   cases  population
 0  Afghanistan  1999     745    19987071
 1  Afghanistan  2000    2666    20595360
 2       Brazil  1999   37737   172006362
 3       Brazil  2000   80488   174504898
 4        China  1999  212258  1272915272
 5        China  2000  213766  1280428583,
 'table2':         country  year        type       count
 0   Afghanistan  1999       cases         745
 1   Afghanistan  1999  population    19987071
 2   Afghanistan  2000       cases        2666
 3   Afghanistan  2000  population    20595360
 4        Brazil  1999       cases       37737
 5        Brazil  1999  population   172006362
 6        Brazil  2000       cases       80488
 7        Brazil  2000  population   174504898
 8         China  1999       cases      212258
 9         China  1999  population  1272915272
 10        China  2000       cases      213766
 11        China  2000  population  1280428583,
 'table3':        country  year               rate
 0  Afghanistan  1999       745/19987071
 1  Afghanistan  2000      2666/20595360
 2       Brazil  1999    37737/172006362
 3       Brazil  2000    80488/174504898
 4        China  1999  212258/1272915272
 5        China  2000  213766/1280428583,
 'table4a':        country    1999    2000
 0  Afghanistan     745    2666
 1       Brazil   37737   80488
 2        China  212258  213766,
 'table4b':        country        1999        2000
 0  Afghanistan    19987071    20595360
 1       Brazil   172006362   174504898
 2        China  1272915272  1280428583,
 'table5':        country  century  year               rate
 0  Afghanistan       19    99       745/19987071
 1  Afghanistan       20     0      2666/20595360
 2       Brazil       19    99    37737/172006362
 3       Brazil       20     0    80488/174504898
 4        China       19    99  212258/1272915272
 5        China       20     0  213766/1280428583}

### 1 (C)

Write why each of table1, table2, table3, (table4a + table4b) and table5 are or are not tidy, and, if not, how would you transform them to make them tidy.

table1 is tidy

table2 is not tidy since the column `type` contains 2 kinds of data

table3 is not tidy, since the `rate` column is a composite column with both cases and population, as a string

tables 4a and 4b aren't tidy, since the year data are column headers

table5 is nto tidy, since, like table3, the `rate` column is composite, and `century` and `year` can be combined into just year

### 1 (extra credit, 5 points)

Write the Python code below that would transform each of the data sets (or the pair `table4a + table4b`) to be tidy.

In [3]:
# Convert table2
pd.pivot_table(tbl_data['table2'],
               index = ['country','year'],
               columns='type', 
               values='count').reset_index()

type      country  year   cases  population
0     Afghanistan  1999     745    19987071
1     Afghanistan  2000    2666    20595360
2          Brazil  1999   37737   172006362
3          Brazil  2000   80488   174504898
4           China  1999  212258  1272915272
5           China  2000  213766  1280428583

In [4]:
tbl_data['table3']
var_split = tbl_data['table3']['rate'].str.split('/', expand=True)
var_split.columns = ['cases','population']
var_split = var_split.astype(int)
pd.concat([tbl_data['table3'], var_split],axis=1).drop(['rate'], axis=1)

       country  year   cases  population
0  Afghanistan  1999     745    19987071
1  Afghanistan  2000    2666    20595360
2       Brazil  1999   37737   172006362
3       Brazil  2000   80488   174504898
4        China  1999  212258  1272915272
5        China  2000  213766  1280428583

In [5]:
d1 = tbl_data['table4a'].melt(id_vars = 'country',var_name='year', value_name = 'cases')
d2 = tbl_data['table4b'].melt(id_vars = 'country', var_name='year', value_name = 'population')
pd.merge(d1, d2, left_on = ['country','year'], right_on = ['country','year'])

       country  year   cases  population
0  Afghanistan  1999     745    19987071
1       Brazil  1999   37737   172006362
2        China  1999  212258  1272915272
3  Afghanistan  2000    2666    20595360
4       Brazil  2000   80488   174504898
5        China  2000  213766  1280428583

In [6]:
d = tbl_data['table5'].copy()
d['year'] = [str(x) + str(y).zfill(2) for x,y in zip(d['century'],d['year'])]
d1 = d['rate'].str.split('/', expand=True).astype(int).set_axis(['cases','population'], axis=1)
d = pd.concat([d, d1], axis=1).drop(['century','rate'], axis=1)
d

       country  year   cases  population
0  Afghanistan  1999     745    19987071
1  Afghanistan  2000    2666    20595360
2       Brazil  1999   37737   172006362
3       Brazil  2000   80488   174504898
4        China  1999  212258  1272915272
5        China  2000  213766  1280428583

## Question 2

### 2 (A)

Read in to Python the gapminder dataset. Note from the slides how to read it in, since it is tab-delimited. Call it `gapm`

In [7]:
gapm = pd.read_csv('data/gapminder.tsv', sep='\t')

### 2 (B)

We want to create the following plot:

![](bar1.png)

To create this we need to get our data in shape!

First, find the average life expectancy by continent in 2007. Make sure your result is a `DataFrame` and not a `Series` by appropriate use of `reset_index`.

In [8]:
gapm2 = gapm[gapm.year==2007].groupby('continent')['lifeExp'].mean().reset_index()
gapm2

  continent    lifeExp
0    Africa  54.806038
1  Americas  73.608120
2      Asia  70.728485
3    Europe  77.648600
4   Oceania  80.719500

### 2 (C) 

Apply the function `sort_values` to the DataFrame created in 2(B) to re-arrange the rows in increasing order of life expectancy. Use the help features or Google to figure out how to use `sort_values`

In [9]:
gapm2=gapm2.sort_values('lifeExp')
gapm2

  continent    lifeExp
0    Africa  54.806038
2      Asia  70.728485
1  Americas  73.608120
3    Europe  77.648600
4   Oceania  80.719500

## Question 3

### 3 (A)

Download the files BreastCancer_Clinical.xlsx and BreastCancer_Expression.xlsx from Canvas. Read both of these data into Python, calling them `brca_clin` and `brca_expr`, respectively.

In [10]:
brca_clin = pd.read_excel('data/BreastCancer_Clinical.xlsx')
brca_expr = pd.read_excel('data/BreastCancer_Expression.xlsx')

### 3 (B)

Identify the common subject identifier in the two datasets and merge `brca_clin` with `brca_expr` using a left join, calling the result `brca`. To check, this merged dataset should have 108 rows and 41 columns

In [11]:
brca = brca_clin.merge(brca_expr, left_on='Complete TCGA ID', right_on = 'TCGA_ID', how='left')
print(f"brca has {brca.shape[0]} rows and {brca.shape[1]} columns")
brca.head()

brca has 108 rows and 41 columns

,Complete TCGA ID,Gender,Age at Initial Pathologic Diagnosis,ER Status,PR Status,HER2 Final Status,Tumor,Tumor--T1 Coded,Node,Node-Coded,...,NP_958782,NP_958785,NP_958786,NP_000436,NP_958781,NP_958780,NP_958783,NP_958784,NP_112598,NP_001611
0,TCGA-A2-A0T2,FEMALE,66,Negative,Negative,Negative,T3,T_Other,N3,Positive,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,TCGA-A2-A0CM,FEMALE,40,Negative,Negative,Negative,T2,T_Other,N0,Negative,...,0.683404,0.694424,0.698098,0.687077,0.687077,0.698098,0.698098,0.698098,-2.65215,-0.984373
2,TCGA-BH-A18V,FEMALE,48,Negative,Negative,Negative,T2,T_Other,N1,Positive,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,TCGA-BH-A18Q,FEMALE,56,Negative,Negative,Negative,T2,T_Other,N1,Positive,...,0.195341,0.215413,0.215413,0.205377,0.215413,0.215413,0.215413,0.215413,-1.03576,-0.517226
4,TCGA-BH-A0E0,FEMALE,38,Negative,Negative,Negative,T3,T_Other,N3,Positive,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### 3 (C)

Find the mean expression of the proteins NP_958782 & NP_958785 by ER status.

In [12]:
brca.groupby('ER Status')[['NP_958782','NP_958785']].mean()

               NP_958782  NP_958785
ER Status
Indeterminate        NaN        NaN
Negative        0.429280   0.437703
Positive        0.267476   0.273189

### 3 (Extra credit, 5 points)

Create a new column `Status` in `brca` that equals "HR + " if either ER or PR are positive, "HER2" if HER2 Final Status is positive, and "Triple Neg" if all of ER, PR and HER2 status are negative, and 'Other' otherwise.

In [13]:
d = pd.Series('Other', brca.index) # Initialize Series with same number of rows as brca
d[(brca['ER Status']=='Positive')|(brca['PR Status']=='Positive')] = 'HR +'
d[brca['HER2 Final Status'] == 'Positive'] = 'HER2'
d[(brca['ER Status']=='Negative') & 
  (brca['PR Status']=='Negative') & 
  (brca['HER2 Final Status'] == 'Negative')]='Triple Neg'
brca['Status'] = d
brca.head()

,Complete TCGA ID,Gender,Age at Initial Pathologic Diagnosis,ER Status,PR Status,HER2 Final Status,Tumor,Tumor--T1 Coded,Node,Node-Coded,...,NP_958785,NP_958786,NP_000436,NP_958781,NP_958780,NP_958783,NP_958784,NP_112598,NP_001611,Status
0,TCGA-A2-A0T2,FEMALE,66,Negative,Negative,Negative,T3,T_Other,N3,Positive,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Triple Neg
1,TCGA-A2-A0CM,FEMALE,40,Negative,Negative,Negative,T2,T_Other,N0,Negative,...,0.694424,0.698098,0.687077,0.687077,0.698098,0.698098,0.698098,-2.65215,-0.984373,Triple Neg
2,TCGA-BH-A18V,FEMALE,48,Negative,Negative,Negative,T2,T_Other,N1,Positive,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Triple Neg
3,TCGA-BH-A18Q,FEMALE,56,Negative,Negative,Negative,T2,T_Other,N1,Positive,...,0.215413,0.215413,0.205377,0.215413,0.215413,0.215413,0.215413,-1.03576,-0.517226,Triple Neg
4,TCGA-BH-A0E0,FEMALE,38,Negative,Negative,Negative,T3,T_Other,N3,Positive,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Triple Neg

## Extra credit (15 points)

Download weather.csv into your `data` directory. Use a combination of Python data munging (transformation) tools to make this data tidy.

In [14]:
weather = pd.read_csv('data/weather.csv')
weather = weather.melt(id_vars=['id','year','month','element'], var_name = 'variable', value_name='rainfall')
weather['day'] = weather['variable'].str.replace('d','').astype(int)
weather.drop('variable', axis=1)
weather = weather.pivot_table(index = ['id','year','month','day'],
                             columns = 'element', values = 'rainfall')
weather = weather.reset_index()
weather = weather.sort_values(['year','month','day'], axis=0)

weather.columns.name=None
weather

         id  year  month  day  tmax  tmin
0   MX17004  2010      1   30  27.8  14.5
1   MX17004  2010      2    2  27.3  14.4
2   MX17004  2010      2    3  24.1  14.4
3   MX17004  2010      2   11  29.7  13.4
4   MX17004  2010      2   23  29.9  10.7
5   MX17004  2010      3    5  32.1  14.2
6   MX17004  2010      3   10  34.5  16.8
7   MX17004  2010      3   16  31.1  17.6
8   MX17004  2010      4   27  36.3  16.7
9   MX17004  2010      5   27  33.2  18.2
10  MX17004  2010      6   17  28.0  17.5
11  MX17004  2010      6   29  30.1  18.0
12  MX17004  2010      7    3  28.6  17.5
13  MX17004  2010      7   14  29.9  16.5
15  MX17004  2010      8    5  29.6  15.8
17  MX17004  2010      8    8  29.0  17.3
18  MX17004  2010      8   13  29.8  16.5
14  MX17004  2010      8   23  26.4  15.0
19  MX17004  2010      8   25  29.7  15.6
16  MX17004  2010      8   29  28.0  15.3
20  MX17004  2010      8   31  25.4  15.4
21  MX17004  2010     10    5  27.0  14.0
23  MX17004  2010     10    7  28.1  12.9
22  MX17004  2010     10   14  29.5  13.0
24  MX17004  2010     10   15  28.7  10.5
25  MX17004  2010     10   28  31.2  15.0
26  MX17004  2010     11    2  31.3  16.3
29  MX17004  2010     11    4  27.2  12.0
27  MX17004  2010     11    5  26.3   7.9
30  MX17004  2010     11   26  28.1  12.1
28  MX17004  2010     11   27  27.7  14.2
31  MX17004  2010     12    1  29.9  13.8
32  MX17004  2010     12    6  27.8  10.5

In [15]:
import os
os.system('jupyter nbconvert --to html BIOF440_HW2_Solution.ipynb')

0